# 站点标题
SITE_NAME = "EndOfYear"

# 站点服务模式
SITE_SERVICE_WEB = 1
SITE_SERVICE_STATIC = 0

# 时区
TIME_ZONE = "Asia/Shanghai"

# 时间格式
FORMAT_TIME = "%Y-%m-%d %H:%M:%S"

# 博客文章分类-生活
BLOG_POST_CATEGORY_LIFE = 1

# 博客文章分类-技术
BLOG_POST_CATEGORY_TECH = 2

# 博客文章关键字数量
BLOG_MAX_KEYS = 7

# 农历节假日
LUNAR_HOLIDAYS = {
    (1, 1): '春节',
    (1, 15): '元宵节',
    (2, 2): '龙抬头',
    (5, 5): '端午节',
    (7, 7): '七夕节',
    (7, 15): '中元节',
    (8, 15): '中秋节',
    (9, 9): '重阳节',
    (12, 8): '腊八节',
    (12, 23): '小年',
    (12, 30): '除夕'
}

# 公历节假日
SOLAR_HOLIDAYS = {
    (1, 1): '元旦',
    (2, 14): '情人节',
    (3, 8): '妇女节',
    (4, 4): '清明节',
    (5, 1): '劳动节',
    (10, 1): '国庆节',
    (12, 13): '南京大屠杀纪念日',
    (9, 18): '九一八事变纪念日',
    (12, 7): '南京保卫战胜利纪念日',
    (8, 15): '抗日战争胜利纪念日'
}
